Revit 2026 API

# ViewScheduleGetSegmentCount Method

---

Gets the total count of schedule segments.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int GetSegmentCount()
```
```vb
Public Function GetSegmentCount As Integer
```
```cpp
public:
int GetSegmentCount()
```
```fsharp
member GetSegmentCount : unit -> int
```

#### Return Value

Int32 The total count of schedule segments. 1 means the schedule is not split yet.

There will be at least one segment for a schedule.

#### Reference

ViewSchedule Class

Autodesk.Revit.DB Namespace